; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=225, out_folder=htg/blocksworld/training, instance_id=35, seed=2059, goal_proportion=0.03

(define (problem blocksworld-35)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 - object)
 (:init 
    (arm-empty)
    (clear b130)
    (on b130 b53)
    (on-table b53)
    (clear b221)
    (on-table b221)
    (clear b109)
    (on-table b109)
    (clear b202)
    (on b202 b123)
    (on-table b123)
    (clear b86)
    (on b86 b94)
    (on-table b94)
    (clear b131)
    (on b131 b170)
    (on b170 b12)
    (on b12 b84)
    (on b84 b209)
    (on b209 b207)
    (on-table b207)
    (clear b96)
    (on b96 b132)
    (on b132 b95)
    (on b95 b91)
    (on-table b91)
    (clear b222)
    (on b222 b28)
    (on b28 b33)
    (on b33 b89)
    (on b89 b214)
    (on b214 b70)
    (on-table b70)
    (clear b106)
    (on b106 b64)
    (on b64 b114)
    (on b114 b178)
    (on-table b178)
    (clear b199)
    (on-table b199)
    (clear b203)
    (on b203 b93)
    (on-table b93)
    (clear b197)
    (on b197 b154)
    (on b154 b146)
    (on b146 b14)
    (on b14 b139)
    (on b139 b174)
    (on b174 b31)
    (on-table b31)
    (clear b112)
    (on b112 b155)
    (on b155 b76)
    (on b76 b7)
    (on b7 b99)
    (on b99 b159)
    (on b159 b88)
    (on b88 b100)
    (on b100 b104)
    (on b104 b73)
    (on-table b73)
    (clear b169)
    (on b169 b190)
    (on-table b190)
    (clear b81)
    (on-table b81)
    (clear b220)
    (on-table b220)
    (clear b138)
    (on b138 b83)
    (on b83 b142)
    (on b142 b128)
    (on-table b128)
    (clear b148)
    (on b148 b179)
    (on b179 b198)
    (on b198 b15)
    (on b15 b211)
    (on b211 b168)
    (on b168 b62)
    (on b62 b194)
    (on b194 b210)
    (on-table b210)
    (clear b47)
    (on b47 b79)
    (on b79 b185)
    (on b185 b22)
    (on b22 b182)
    (on b182 b71)
    (on b71 b27)
    (on b27 b165)
    (on-table b165)
    (clear b1)
    (on b1 b225)
    (on b225 b206)
    (on b206 b141)
    (on b141 b140)
    (on b140 b191)
    (on b191 b125)
    (on-table b125)
    (clear b74)
    (on b74 b218)
    (on b218 b147)
    (on b147 b72)
    (on b72 b217)
    (on b217 b160)
    (on b160 b126)
    (on b126 b98)
    (on-table b98)
    (clear b20)
    (on b20 b136)
    (on b136 b200)
    (on b200 b4)
    (on-table b4)
    (clear b129)
    (on b129 b151)
    (on b151 b162)
    (on b162 b87)
    (on b87 b188)
    (on b188 b8)
    (on-table b8)
    (clear b97)
    (on b97 b124)
    (on b124 b219)
    (on b219 b113)
    (on b113 b164)
    (on b164 b24)
    (on b24 b161)
    (on b161 b13)
    (on b13 b11)
    (on b11 b3)
    (on b3 b143)
    (on b143 b121)
    (on b121 b75)
    (on b75 b186)
    (on b186 b101)
    (on b101 b205)
    (on b205 b48)
    (on b48 b157)
    (on b157 b26)
    (on-table b26)
    (clear b9)
    (on-table b9)
    (clear b50)
    (on-table b50)
    (clear b37)
    (on b37 b92)
    (on-table b92)
    (clear b63)
    (on-table b63)
    (clear b102)
    (on b102 b38)
    (on b38 b134)
    (on-table b134)
    (clear b133)
    (on b133 b120)
    (on-table b120)
    (clear b6)
    (on b6 b57)
    (on b57 b16)
    (on-table b16)
    (clear b177)
    (on-table b177)
    (clear b17)
    (on b17 b65)
    (on b65 b51)
    (on-table b51)
    (clear b77)
    (on b77 b196)
    (on b196 b156)
    (on b156 b2)
    (on b2 b181)
    (on-table b181)
    (clear b68)
    (on-table b68)
    (clear b189)
    (on b189 b66)
    (on b66 b135)
    (on b135 b58)
    (on b58 b21)
    (on-table b21)
    (clear b192)
    (on b192 b204)
    (on b204 b145)
    (on b145 b82)
    (on b82 b163)
    (on-table b163)
    (clear b167)
    (on b167 b175)
    (on b175 b224)
    (on b224 b45)
    (on b45 b43)
    (on b43 b118)
    (on b118 b152)
    (on b152 b150)
    (on b150 b110)
    (on b110 b215)
    (on b215 b176)
    (on b176 b103)
    (on-table b103)
    (clear b85)
    (on b85 b60)
    (on-table b60)
    (clear b32)
    (on b32 b46)
    (on-table b46)
    (clear b5)
    (on b5 b10)
    (on b10 b90)
    (on-table b90)
    (clear b52)
    (on b52 b119)
    (on-table b119)
    (clear b212)
    (on-table b212)
    (clear b35)
    (on b35 b127)
    (on b127 b183)
    (on b183 b171)
    (on b171 b34)
    (on b34 b105)
    (on b105 b56)
    (on b56 b78)
    (on b78 b54)
    (on-table b54)
    (clear b187)
    (on b187 b193)
    (on b193 b223)
    (on b223 b144)
    (on-table b144)
    (clear b172)
    (on b172 b137)
    (on b137 b29)
    (on b29 b59)
    (on b59 b158)
    (on b158 b18)
    (on b18 b115)
    (on-table b115)
    (clear b111)
    (on b111 b19)
    (on-table b19)
    (clear b201)
    (on-table b201)
    (clear b55)
    (on b55 b208)
    (on b208 b44)
    (on b44 b41)
    (on b41 b69)
    (on b69 b80)
    (on-table b80)
    (clear b195)
    (on b195 b61)
    (on b61 b39)
    (on b39 b184)
    (on b184 b40)
    (on b40 b180)
    (on b180 b30)
    (on b30 b42)
    (on-table b42)
    (clear b25)
    (on b25 b173)
    (on b173 b166)
    (on b166 b153)
    (on b153 b216)
    (on b216 b213)
    (on b213 b122)
    (on-table b122)
    (clear b36)
    (on b36 b49)
    (on b49 b116)
    (on b116 b149)
    (on b149 b67)
    (on-table b67)
    (clear b108)
    (on-table b108)
    (clear b117)
    (on b117 b23)
    (on b23 b107)
    (on-table b107))
 (:goal  (and 
    (clear b6)
    (on-table b6)
    (clear b4)
    (on b4 b3)
    (on b3 b5)
    (on b5 b2)
    (on b2 b1)
    (on-table b1))))

; plan
1. (unstack b1 b225)
   deleted: (on b1 b225) (clear b1) (arm-empty)
   added: (holding b1) (clear b225)
   goals met: 1 of 8
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 8
3. (unstack b6 b57)
   deleted: (on b6 b57) (clear b6) (arm-empty)
   added: (holding b6) (clear b57)
   goals met: 1 of 8
4. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 8
5. (unstack b20 b136)
   deleted: (on b20 b136) (clear b20) (arm-empty)
   added: (holding b20) (clear b136)
   goals met: 3 of 8
6. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 3 of 8
7. (unstack b136 b200)
   deleted: (on b136 b200) (clear b136) (arm-empty)
   added: (holding b136) (clear b200)
   goals met: 3 of 8
8. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 3 of 8
9. (unstack b200 b4)
   deleted: (on b200 b4) (clear b200) (arm-empty)
   added: (holding b200) (clear b4)
   goals met: 4 of 8
10. (putdown b200)
   deleted: (holding b200)
   added: (clear b200) (arm-empty) (on-table b200)
   goals met: 4 of 8
11. (unstack b77 b196)
   deleted: (on b77 b196) (clear b77) (arm-empty)
   added: (holding b77) (clear b196)
   goals met: 4 of 8
12. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 4 of 8
13. (unstack b196 b156)
   deleted: (on b196 b156) (clear b196) (arm-empty)
   added: (holding b196) (clear b156)
   goals met: 4 of 8
14. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 4 of 8
15. (unstack b156 b2)
   deleted: (on b156 b2) (clear b156) (arm-empty)
   added: (holding b156) (clear b2)
   goals met: 4 of 8
16. (putdown b156)
   deleted: (holding b156)
   added: (clear b156) (arm-empty) (on-table b156)
   goals met: 4 of 8
17. (unstack b97 b124)
   deleted: (on b97 b124) (clear b97) (arm-empty)
   added: (holding b97) (clear b124)
   goals met: 4 of 8
18. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 4 of 8
19. (unstack b124 b219)
   deleted: (on b124 b219) (clear b124) (arm-empty)
   added: (holding b124) (clear b219)
   goals met: 4 of 8
20. (putdown b124)
   deleted: (holding b124)
   added: (clear b124) (arm-empty) (on-table b124)
   goals met: 4 of 8
21. (unstack b219 b113)
   deleted: (on b219 b113) (clear b219) (arm-empty)
   added: (holding b219) (clear b113)
   goals met: 4 of 8
22. (putdown b219)
   deleted: (holding b219)
   added: (clear b219) (arm-empty) (on-table b219)
   goals met: 4 of 8
23. (unstack b113 b164)
   deleted: (on b113 b164) (clear b113) (arm-empty)
   added: (holding b113) (clear b164)
   goals met: 4 of 8
24. (putdown b113)
   deleted: (holding b113)
   added: (clear b113) (arm-empty) (on-table b113)
   goals met: 4 of 8
25. (unstack b164 b24)
   deleted: (on b164 b24) (clear b164) (arm-empty)
   added: (holding b164) (clear b24)
   goals met: 4 of 8
26. (putdown b164)
   deleted: (holding b164)
   added: (clear b164) (arm-empty) (on-table b164)
   goals met: 4 of 8
27. (unstack b24 b161)
   deleted: (on b24 b161) (clear b24) (arm-empty)
   added: (holding b24) (clear b161)
   goals met: 4 of 8
28. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 4 of 8
29. (unstack b161 b13)
   deleted: (on b161 b13) (clear b161) (arm-empty)
   added: (holding b161) (clear b13)
   goals met: 4 of 8
30. (putdown b161)
   deleted: (holding b161)
   added: (clear b161) (arm-empty) (on-table b161)
   goals met: 4 of 8
31. (unstack b13 b11)
   deleted: (on b13 b11) (clear b13) (arm-empty)
   added: (holding b13) (clear b11)
   goals met: 4 of 8
32. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 4 of 8
33. (unstack b11 b3)
   deleted: (on b11 b3) (clear b11) (arm-empty)
   added: (holding b11) (clear b3)
   goals met: 4 of 8
34. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 4 of 8
35. (unstack b2 b181)
   deleted: (on b2 b181) (clear b2) (arm-empty)
   added: (holding b2) (clear b181)
   goals met: 4 of 8
36. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 5 of 8
37. (unstack b5 b10)
   deleted: (on b5 b10) (clear b5) (arm-empty)
   added: (holding b5) (clear b10)
   goals met: 5 of 8
38. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 6 of 8
39. (unstack b3 b143)
   deleted: (on b3 b143) (clear b3) (arm-empty)
   added: (holding b3) (clear b143)
   goals met: 6 of 8
40. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 7 of 8
41. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 6 of 8
42. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 8 of 8
